
const emoj_qlwek123_lqweppp1za2q_afk = [
    "😀", "😃", "😄", "😁", "😆", "😅", "🤣", "😂", "🙂", "🙃", "🫠", "😉", "😊", "😇",
    "🥰", "😍", "🤩", "😘", "😗", "☺️", "☺", "😚", "😙", "🥲", "😋", "😛", "😜", "🤪",
    "😝", "🤑", "🤗", "🤭", "🫢", "🫣", "🤫", "🤔", "🫡", "🤐", "🤨", "😐", "😑", "😶",
    "🫥", "😶‍🌫️", "😶‍🌫", "😏", "😒", "🙄", "😬", "😮‍💨", "🤥", "🫨", "😌", "😔",
    "😪", "🤤", "😴", "😷", "🤒", "🤕", "🤢", "🤮", "🤧", "🥵", "🥶", "🥴", "😵",
    "😵‍💫", "🤯", "🤠", "🥳", "🥸", "😎", "🤓", "🧐", "😕", "🫤", "😟", "🙁", "☹️",
    "☹", "😮", "😯", "😲", "😳", "🥺", "🥹", "😦", "😧", "😨", "😰", "😥", "😢",
    "😭", "😱", "😖", "😣", "😞", "😓", "😩", "😫", "🥱", "😤", "😡", "😠", "🤬",
    "😈", "👿", "💀", "☠️", "☠", "💩", "🤡", "👹", "👺", "👻", "👽", "👾", "🤖",
    "😺", "😸", "😹", "😻", "😼", "😽", "🙀", "😿", "😾", "🙈", "🙉", "🙊", "💌",
    "💘", "💝", "💖", "💗", "💓", "💞", "💕", "💟", "❣️", "❣", "💔", "❤️‍🔥",
    "❤‍🔥", "❤️‍🩹", "❤‍🩹", "❤️", "❤", "🩷", "🧡", "💛", "💚", "💙", "🩵",
    "💜", "🤎", "🖤", "🩶", "🤍",
    "💋", "💯", "💢", "💥", "💦", "💨", "💫", "💯", "🕳️", "🕳", "👁️‍🗨️", "👁‍🗨️",
    "👁️‍🗨", "👁‍🗨", "🗨️", "🗨", "🗯️", "🗯", "💬", "👁️‍🗨️", "👁‍🗨️",
    "👁️‍🗨", "👁‍🗨", "🗨️", "🗨", "💭", "💤"
];







const Smile_People = [
  "😍", "🧟‍♂️", "🧟‍♀️", "🧌", "💆", "💆‍♂️", "💆‍♀️", "💇", "💇‍♂️", "💇‍♀️", "🚶", "🚶‍♂️", "🚶‍♀️",
  "🧍", "🧍‍♂️", "🧍‍♀️", "🧎", "🧎‍♂️", "🧎‍♀️", "🧑‍🦯", "👨‍🦯", "👩‍🦯", "🧑‍🦼", "👨‍🦼", "👩‍🦼",
  "🧑‍🦽", "👨‍🦽", "👩‍🦽", "🏃", "🏃‍♂️", "🏃‍♀️", "💃", "🕺", "🕴️", "👯", "👯‍♂️", "👯‍♀️",
  "🧖", "🧖‍♂️", "🧖‍♀️", "🧗", "🧗‍♂️", "🧗‍♀️", "🤺", "🏇", "⛷️", "🏂", "🏌️", "🏌️‍♂️", "🏌️‍♀️",
  "🏄", "🏄‍♂️", "🏄‍♀️", "🚣", "🚣‍♂️", "🚣‍♀️", "🏊", "🏊‍♂️", "🏊‍♀️", "⛹️", "⛹️‍♂️", "⛹️‍♀️",
  "🏋️", "🏋️‍♂️", "🏋️‍♀️", "🚴", "🚴‍♂️", "🚴‍♀️", "🚵", "🚵‍♂️", "🚵‍♀️", "🤸", "🤸‍♂️", "🤸‍♀️",
  "🤼", "🤼‍♂️", "🤼‍♀️", "🤽", "🤽‍♂️", "🤽‍♀️", "🤾", "🤾‍♂️", "🤾‍♀️", "🤹", "🤹‍♂️", "🤹‍♀️",
  "🧘", "🧘‍♂️", "🧘‍♀️", "🛀", "🛌", "🧑‍🤝‍🧑", "👭", "👫", "👬", "💏", "👩‍❤️‍💋‍👨", "👨‍❤️‍💋‍👨",
  "👩‍❤️‍💋‍👩", "💑", "👩‍❤️‍👨", "👨‍❤️‍👨", "👩‍❤️‍👩", "👪", "👨‍👩‍👦", "👨‍👩‍👧", "👨‍👩‍👧‍👦",
  "👨‍👩‍👦‍👦", "👨‍👩‍👧‍👧", "👨‍👨‍👦", "👨‍👨‍👧", "👨‍👨‍👧‍👦", "👨‍👨‍👦‍👦", "👨‍👨‍👧‍👧",
  "👩‍👩‍👦", "👩‍👩‍👧", "👩‍👩‍👧‍👦", "👩‍👩‍👦‍👦", "👩‍👩‍👧‍👧", "👨‍👦", "👨‍👦‍👦", "👨‍👧",
  "👨‍👧‍👦", "👨‍👧‍👧", "👩‍👦", "👩‍👦‍👦", "👩‍👧", "👩‍👧‍👦", "👩‍👧‍👧", "🗣️", "👤", "👥",
  "🫂", "👣", "😺", "😸", "😹", "😻", "😼", "😽", "🙀", "😿", "😾", "🙈", "🙉", "🙊", "💋", "💌", "💘",
  "💝", "💖", "💗", "💓", "💞", "💕", "💟", "❣️", "💔", "❤","‍🔥","❤","🩹", "❤️", "🧡", "💛", "💚", "💙","💜", "🤎", "🖤", "🤍", "💯", "💢", "💥", "💫", "💦", "💨", "🕳️", "💣", "💬", "👁️‍🗨️", "🗨️", "🗯️",
  "💭", "💤"
];


const animalEmojis = [
  "🐵", "🐒", "🦍", "🦧", "🐶", "🐕", "🦮", "🐕‍🦺", "🐩", "🐺", "🦊", "🦝", "🐱", "🐈", "🐈‍⬛", "🦁",
  "🐯", "🐅", "🐆", "🐴", "🐎", "🦄", "🦓", "🦌", "🦬", "🐮", "🐂", "🐃", "🐄", "🐷", "🐖", "🐗", "🐽",
  "🐏", "🐑", "🐐", "🐪", "🐫", "🦙", "🦒", "🐘", "🦣", "🦏", "🦛", "🐭", "🐁", "🐀", "🐹", "🐰", "🐇",
  "🐿️", "🦫", "🦔", "🦇", "🐻", "🐻‍❄️", "🐨", "🐼", "🦥", "🦦", "🦨", "🦘", "🦡", "🐾", "🦃", "🐔",
  "🐓", "🐣", "🐤", "🐥", "🐦", "🐧", "🕊️", "🦅", "🦆", "🦢", "🦉", "🦤", "🪶", "🦩", "🦚", "🦜",
  "🐸", "🐊", "🐢", "🦎", "🐍", "🐲", "🐉", "🦕", "🦖", "🐳", "🐋", "🐬", "🦭", "🐟", "🐠", "🐡",
  "🦈", "🐙", "🐚", "🪸", "🐌", "🦋", "🐛", "🐜", "🐝", "🪲", "🐞", "🦗", "🪳", "🕷️", "🕸️", "🦂",
  "🦟", "🪰", "🪱", "🦠",
  "💐", "🌸", "💮", "🪷", "🏵️", "🌹", "🥀", "🌺", "🌻", "🌼", "🌷", "🌱", "🪴", "🌲", "🌳", "🌴",
  "🌵", "🌾", "🌿", "☘️", "🍀", "🍁", "🍂", "🍃", "🪹", "🪺"
];


const foodEmojis = [
  "🥬", "🥦", "🧄", "🧅", "🍄", "🥜", "🫘", "🌰", "🍞", "🥐", "🥖", "🫓", "🥨", "🥯", "🥞", "🧇", "🧀",
  "🍖", "🍗", "🥩", "🥓", "🍔", "🍟", "🍕", "🌭", "🥪", "🌮", "🌯", "🫔", "🥙", "🧆", "🥚", "🍳", "🥘", "🍲",
  "🫕", "🥣", "🥗", "🍿", "🧈", "🧂", "🥫", "🍱", "🍘", "🍙", "🍚", "🍛", "🍜", "🍝", "🍠", "🍢", "🍣", "🍤",
  "🍥", "🥮", "🍡", "🥟", "🥠", "🥡", "🦀", "🦞", "🦐", "🦑", "🦪", "🍦", "🍧", "🍨", "🍩", "🍪", "🎂", "🍰",
  "🧁", "🥧", "🍫", "🍬", "🍭", "🍮", "🍯", "🍼", "🥛", "☕", "🫖", "🍵", "🍶", "🍾", "🍷", "🍸", "🍹", "🍺",
  "🍻", "🥂", "🥃", "🫗", "🥤", "🧋", "🧃", "🧉", "🧊", "🥢", "🍽️", "🍴", "🥄", "🔪", "🫙", "🏺"
];



const celebrationEmojis = [
  "🎃", "🎄", "🎆", "🎇", "🧨", "✨", "🎈", "🎉", "🎊", "🎋", "🎍", "🎎", "🎏", "🎐", "🎑", "🧧", "🎀",
  "🎁", "🎗️", "🎟️", "🎫", "🎖️", "🏆", "🏅", "🥇", "🥈", "🥉", "⚽", "⚾", "🥎", "🏀", "🏐", "🏈", "🏉",
  "🎾", "🥏", "🎳", "🏏", "🏑", "🏒", "🥍", "🏓", "🏸", "🥊", "🥋", "🥅", "⛳", "⛸️", "🎣", "🤿", "🎽",
  "🎿", "🛷", "🥌", "🎯", "🪀", "🪁", "🎱", "🔮", "🪄", "🧿", "🪬", "🎮", "🕹️", "🎰", "🎲", "🧩", "🧸",
  "🪅", "🪩", "🪆", "♠️", "♥️", "♦️", "♣️", "♟️", "🃏", "🀄", "🎴", "🎭", "🖼️", "🎨", "🧵", "🪡", "🧶",
  "🪢"
];


const transportWeatherEmojis = [
  "🚈", "🚉", "🚊", "🚝", "🚞", "🚋", "🚌", "🚍", "🚎", "🚐", "🚑", "🚒", "🚓", "🚔", "🚕", "🚖", "🚗", "🚘", "🚙",
  "🛻", "🚚", "🚛", "🚜", "🏎️", "🏍️", "🛵", "🦽", "🦼", "🛺", "🚲", "🛴", "🛹", "🛼", "🚏", "🛣️", "🛤️", "🛢️", "⛽",
  "🛞", "🚨", "🚥", "🚦", "🛑", "🚧", "⚓", "🛟", "⛵", "🛶", "🚤", "🛳️", "⛴️", "🛥️", "🚢", "✈️", "🛩️", "🛫", "🛬",
  "🪂", "💺", "🚁", "🚟", "🚠", "🚡", "🛰️", "🚀", "🛸", "🛎️", "🧳", "⌛", "⏳", "⌚", "⏰", "⏱️", "⏲️", "🕰️", "🕛",
  "🕧", "🕐", "🕜", "🕑", "🕝", "🕒", "🕞", "🕓", "🕟", "🕔", "🕠", "🕕", "🕡", "🕖", "🕢", "🕗", "🕣", "🕘", "🕤", "🕙",
  "🕥", "🕚", "🕦", "🌑", "🌒", "🌓", "🌔", "🌕", "🌖", "🌗", "🌘", "🌙", "🌚", "🌛", "🌜", "🌡️", "☀️", "🌝", "🌞", "🪐",
  "⭐", "🌟", "🌠", "🌌", "☁️", "⛅", "⛈️", "🌤️", "🌥️", "🌦️", "🌧️", "🌨️", "🌩️", "🌪️", "🌫️", "🌬️", "🌀", "🌈",
  "🌂", "☂️", "☔", "⛱️", "⚡", "❄️", "☃️", "⛄", "☄️", "🔥", "💧", "🌊"
];


const officeToolsHouseholdEmojis = [
  "📃", "📜", "📄", "📰", "🗞️", "📑", "🔖", "🏷️", "💰", "🪙", "💴", "💵", "💶", "💷", "💸", "💳", "🧾", "💹",
  "✉️", "📧", "📨", "📩", "📤", "📥", "📦", "📫", "📪", "📬", "📭", "📮", "🗳️", "✏️", "✒️", "🖋️", "🖊️", "🖌️",
  "🖍️", "📝", "💼", "📁", "📂", "🗂️", "📅", "📆", "🗒️", "🗓️", "📇", "📈", "📉", "📊", "📋", "📌", "📍", "📎",
  "🖇️", "📏", "📐", "✂️", "🗃️", "🗄️", "🗑️", "🔒", "🔓", "🔏", "🔐", "🔑", "🗝️", "🔨", "🪓", "⛏️", "⚒️", "🛠️",
  "🗡️", "⚔️", "🔫", "🪃", "🏹", "🛡️", "🪚", "🔧", "🪛", "🔩", "⚙️", "🗜️", "⚖️", "🦯", "🔗", "⛓️", "🪝", "🧰",
  "🧲", "🪜", "⚗️", "🧪", "🧫", "🧬", "🔬", "🔭", "📡", "💉", "🩸", "💊", "🩹", "🩼", "🩺", "🩻", "🚪", "🛗",
  "🪞", "🪟", "🛏️", "🛋️", "🪑", "🚽", "🪠", "🚿", "🛁", "🪤", "🪒", "🧴", "🧷", "🧹", "🧺", "🧻", "🪣", "🧼",
  "🫧", "🪥", "🧽", "🧯", "🛒", "🚬", "⚰️", "🪦", "⚱️", "🗿", "🪧", "🪪"
];



const symbolsCharactersEmojis = [
  "↩️", "↪️", "⤴️", "⤵️", "🔃", "🔄", "🔙", "🔚", "🔛", "🔜", "🔝", "🛐", "⚛️", "🕉️", "✡️", "☸️", "☯️", "✝️", "☦️",
  "☪️", "☮️", "🕎", "🔯", "♈", "♉", "♊", "♋", "♌", "♍", "♎", "♏", "♐", "♑", "♒", "♓", "⛎", "🔀", "🔁", "🔂", "▶️",
  "⏩", "⏭️", "⏯️", "◀️", "⏪", "⏮️", "🔼", "⏫", "🔽", "⏬", "⏸️", "⏹️", "⏺️", "⏏️", "🎦", "🔅", "🔆", "📶", "📳", "📴",
  "♀️", "♂️", "⚧️", "✖️", "➕", "➖", "➗", "🟰", "♾️", "‼️", "⁉️", "❓", "❔", "❕", "❗", "〰️", "💱", "💲", "⚕️", "♻️",
  "⚜️", "🔱", "📛", "🔰", "⭕", "✅", "☑️", "✔️", "❌", "❎", "➰", "➿", "〽️", "✳️", "✴️", "❇️", "©️", "®️", "™️", "️#️⃣",
  "*️⃣", "0️⃣", "1️⃣", "2️⃣", "3️⃣", "4️⃣", "5️⃣", "6️⃣", "7️⃣", "8️⃣", "9️⃣", "🔟", "🔠", "🔡", "🔢", "🔣", "🔤", "🅰️",
  "🆎", "🅱️", "🆑", "🆒", "🆓", "ℹ️", "🆔", "Ⓜ️", "🆕", "🆖", "🅾️", "🆗", "🅿️", "🆘", "🆙", "🆚", "🈁", "🈂️", "🈷️",
  "🈶", "🈯", "🉐", "🈹", "🈚", "🈲", "🉑", "🈸", "🈴", "🈳", "㊗️", "㊙️", "🈺", "🈵", "🔴", "🟠", "🟡", "🟢", "🔵", "🟣",
  "🟤", "⚫", "⚪", "🟥", "🟧", "🟨", "🟩", "🟦", "🟪", "🟫", "⬛", "⬜", "◼️", "◻️", "◾", "◽", "▪️", "▫️", "🔶", "🔷",
  "🔸", "🔹", "🔺", "🔻", "💠", "🔘", "🔳", "🔲"
];





const countryFlagsAndSpecialEmojis = [
  "🇳🇵", "🇳🇷", "🇳🇺", "🇳🇿", "🇴🇲", "🇵🇦", "🇵🇪", "🇵🇫", "🇵🇬", "🇵🇭", "🇵🇰", "🇵🇱", "🇵🇲", "🇵🇳", "🇵🇷", "🇵🇸",
  "🇵🇹", "🇵🇼", "🇵🇾", "🇶🇦", "🇷🇪", "🇷🇴", "🇷🇸", "🇷🇼", "🇸🇦", "🇸🇧", "🇸🇨", "🏴󠁧󠁢󠁳󠁣󠁴󠁿", "🇸🇩", "🇸🇪",
  "🇸🇬", "🇸🇭", "🇸🇮", "🇸🇯", "🇸🇰", "🇸🇱", "🇸🇲", "🇸🇳", "🇸🇴", "🇸🇷", "🇸🇸", "🇸🇹", "🇸🇻", "🇸🇽", "🇸🇾",
  "🇸🇿", "🇹🇦", "🇹🇨", "🇹🇩", "🇹🇫", "🇹🇬", "🇹🇭", "🇹🇯", "🇹🇰", "🇹🇱", "🇹🇲", "🇹🇳", "🇹🇴", "🇹🇷", "🇹🇹",
  "🇹🇻", "🇹🇼", "🇹🇿", "🇺🇦", "🇺🇬", "🇺🇲", "🇺🇳", "🇺🇾", "🇺🇿", "🇻🇦", "🇻🇨", "🇻🇪", "🇻🇬", "🇻🇮", "🇻🇳",
  "🇻🇺", "🏴󠁧󠁢󠁷󠁬󠁳󠁿", "🇼🇫", "🇼🇸", "🇽🇰", "🇾🇪", "🇾🇹", "🇿🇦", "🇿🇲", "🇿🇼", "🇫🇷", "🇬🇧", "🇮🇹", "🇯🇵",
  "🇰🇷", "🏴‍☠️", "🏳️‍🌈", "🇷🇺", "🏳️‍⚧️", "🚩", "🇺🇸", "🏴", "🏳️"
];



var textarea3 = document.getElementById("bb_textarea");

var GlobTextSelt = 0;


function QkecHCTextarea(q) {

var Textq = q

GlobTextSelt = Textq.selectionStart;

console.log(Textq.value)	
	
return 	GlobTextSelt || 0
}





const rednEmojis = (emoji) => {
	
var s1 = document.querySelector(".EmoJisDisp2")	

let selemo1

if (emoji == 1)selemo1 = Smile_People 
else if (emoji == 2)selemo1 = animalEmojis
else if (emoji == 3)selemo1 = foodEmojis
else if (emoji == 4)selemo1 = celebrationEmojis
else if (emoji == 5)selemo1 = transportWeatherEmojis
else if (emoji == 6)selemo1 = officeToolsHouseholdEmojis
else if (emoji == 7)selemo1 = symbolsCharactersEmojis
else if (emoji == 8)selemo1 = countryFlagsAndSpecialEmojis
else  selemo1 = Smile_People 

const qVarDmm1 = s1.innerHTML

if (qVarDmm1.length > 5)
s1.innerHTML = ''


for (var s3 of selemo1) {
	s1.insertAdjacentHTML('beforeend',`<div onclick="modifySelectedText('${s3}')">${s3}</div>`)
}

};




function BeoferEmRender9(){ 
	
	
var s13z13z1aEma = document.querySelectorAll("#dispEmojiPicker")[0]
	
//const range = document.createRange();

var tagSt21ring = `
<div class="relative cls1231DivFrEmojist" id="emojiPicker">

<div class="EmoJiMain">
		<div class="EmoJis">
				<div class="wmEmHovering pointer"> <div onclick="rednEmojis('1')" class="WmojIS11SPn">😊</div></div>
				<div class="wmEmHovering pointer"> <div onclick="rednEmojis('2')" class="WmojIS11SPn">🐹</div></div>
				<div class="wmEmHovering pointer"> <div onclick="rednEmojis('3')" class="WmojIS11SPn">🍕</div></div>	
				<div class="wmEmHovering pointer"> <div onclick="rednEmojis('4')" class="WmojIS11SPn">🏀</div></div>	
				<div class="wmEmHovering pointer"> <div onclick="rednEmojis('5')" class="WmojIS11SPn"> 🚀</div></div>		
				<div class="wmEmHovering pointer"> <div onclick="rednEmojis('6')" class="WmojIS11SPn">💡️</div></div>	
				<div class="wmEmHovering pointer"> <div onclick="rednEmojis('7')" class="WmojIS11SPn">🅰️</div></div>	
				<div class="wmEmHovering pointer"> <div onclick="rednEmojis('8')" class="WmojIS11SPn">🚩</div></div>		
		</div>
</div>

<div class="EmoJisDisp2"> </div>

`;



//const documentFragment = range.createContextualFragment(tagString);

//s13z13z1aEma.appendChild(documentFragment);

s13z13z1aEma.insertAdjacentHTML('afterend', tagSt21ring)

//console.log(s13z13z1aEma)	
	
	
}



function funRndrEmojis() {

//var sqwe = document.querySelector("")
const divElement = document.querySelector('#emojiPicker');


if (divElement) {
	
		emojiPicker.innerHTML = '';
		document.querySelector("#emojiPicker").remove()
		
} else {
	
	BeoferEmRender9()

	rednEmojis('1')	

	
	
}



	
return 0;
}


//document.querySelector("#emojiPicker").addEventListener("click", function(event) {

//console.log(event.target.id)	
	
    // Check if the clicked element is either the parent div or its children
   // if (event.target.closest === ".EmoJiMain" || event.target.closest(".cls1231DivFrEmojist")) {
        //console.log("yy");
    //} //else {
		//document.querySelector("#emojiPicker").innerHTML = ''
        //console.log("Clicked outside of parent div and its children.");
   // }
//});


let globMojEmojistat = 0;

const setFcs1Btn = () => {
	globMojEmojistat = 1
};

const setUnFcs1Btn = () => {
	globMojEmojistat = 0
};



function modifySelectedText(newText) {
	

//const isFocused = document.activeElement === textarea;

//var valu1 = textarea.value

let TxtRRn1frm1 = document.getElementById("bb_textarea");


TxtRRn1frm1.setRangeText(newText, TxtRRn1frm1.selectionStart, TxtRRn1frm1.selectionEnd, "end");
  
TxtRRn1frm1.focus();



/*if (document.hasFocus()) {
	console.log(`yeah`)
}*/

//input.selectionStart
//input.selectionEnd

/*
 
 
*/ 


//var sl123 = textarea.selec

//console.log()


//var s11 = 0;


//var newValue = valu1.slice(0, s11) + newText + valu1.slice(s11);

//textarea.value = newValue



	//textarea.selectionStart = s11;

  
  //textarea.selectionEnd = s11 + newValue.length;




//console.log(s11)


//if (s11) {
	
	//textarea.selectedStart = s11 
//} else {
	//textarea.focus();
	//textarea.selectedStart = s11 
//}



}

